arduino/arduino-cli/legacy/builder/test/user_hardware/my_avr_platform/avr/boards.txt
custom_yun.name=Arduino Yún
custom_yun.upload.via_ssh=true

custom_yun.build.core=arduino:arduino
custom_yun.bootloader.tool=arduino:avrdude
custom_yun.upload.tool=arduino:avrdude

custom_yun.vid.0=0x2341
custom_yun.pid.0=0x0041
custom_yun.vid.1=0x2341
custom_yun.pid.1=0x8041
custom_yun.upload.protocol=avr109
custom_yun.upload.maximum_size=28672
custom_yun.upload.maximum_data_size=2560
custom_yun.upload.speed=57600
custom_yun.upload.disable_flushing=true
custom_yun.upload.use_1200bps_touch=true
custom_yun.upload.wait_for_upload_port=true

custom_yun.bootloader.low_fuses=0xff
custom_yun.bootloader.high_fuses=0xd8
custom_yun.bootloader.extended_fuses=0xfb
custom_yun.bootloader.file=caterina/Caterina-custom_yun.hex
custom_yun.bootloader.unlock_bits=0x3F
custom_yun.bootloader.lock_bits=0x2F

custom_yun.build.mcu=atmega32u4
custom_yun.build.f_cpu=16000000L
custom_yun.build.vid=0x2341
custom_yun.build.pid=0x8041
custom_yun.build.usb_product="Arduino My"
custom_yun.build.board=AVR_YUN
custom_yun.build.variant=arduino:yun
custom_yun.build.extra_flags={build.usb_flags}

mymega.name=Arduino Mega or Mega 2560

mymega.vid.0=0x2341
mymega.pid.0=0x0010
mymega.vid.1=0x2341
mymega.pid.1=0x0042
mymega.vid.2=0x2A03
mymega.pid.2=0x0010
mymega.vid.3=0x2A03
mymega.pid.3=0x0042

mymega.upload.tool=avrdude
mymega.upload.maximum_data_size=8192

mymega.bootloader.tool=avrdude
mymega.bootloader.low_fuses=0xFF
mymega.bootloader.unlock_bits=0x3F
mymega.bootloader.lock_bits=0x0F

mymega.build.f_cpu=16000000L
mymega.build.core=arduino
mymega.build.variant=mega

mymega.menu.cpu.atmega2560=ATmega2560 (Mega 2560)

mymega.menu.cpu.atmega2560.upload.protocol=wiring
mymega.menu.cpu.atmega2560.upload.maximum_size=253952
mymega.menu.cpu.atmega2560.upload.speed=115200

mymega.menu.cpu.atmega2560.bootloader._folder=stk500v2
mymega.menu.cpu.atmega2560.bootloader.high_fuses=0xD8
mymega.menu.cpu.atmega2560.bootloader.extended_fuses=0xFD
mymega.menu.cpu.atmega2560.bootloader.file={bootloader._folder}/stk500boot_v2_mega2560.hex

mymega.menu.cpu.atmega2560.build.mcu=atmega2560
mymega.menu.cpu.atmega2560.build.board=AVR_MYMEGA2560

mymega.menu.cpu.atmega1280=ATmega1280

mymega.menu.cpu.atmega1280.upload.protocol=arduino
mymega.menu.cpu.atmega1280.upload.maximum_size=126976
mymega.menu.cpu.atmega1280.upload.speed=57600

mymega.menu.cpu.atmega1280.bootloader._folder=atmega
mymega.menu.cpu.atmega1280.bootloader.high_fuses=0xDA
mymega.menu.cpu.atmega1280.bootloader.extended_fuses=0xF5
mymega.menu.cpu.atmega1280.bootloader.file={bootloader._folder}/ATmegaBOOT_168_atmega1280.hex

mymega.menu.cpu.atmega1280.build.mcu=atmega1280
mymega.menu.cpu.atmega1280.build.board=AVR_MYMEGA
